{
  "rhinemod:SkyEvent": {
    "NAME": "The Sky",
    "DESCRIPTIONS": ["Standing at the height of the tower, you gaze at the sky once again, filled with countless stars. It is indeed very high here, and ascending from this point would undoubtedly save a lot of effort. You all look at the starry sky, following the wrong trajectory, and continue toward the summit of the tower..."],
    "OPTIONS": ["[Move On!]"]
  },
  "rhinemod:MysteriousInvent": {
    "NAME": "Mysterious Invent",
    "DESCRIPTIONS": [
      "You encountered a group of people who appear to be a research team. They hope to reach the top of the tower and plan to attempt to break through the mysterious sky barrier at the summit.",
      "They placed a badge-shaped object in your hand.",
      "They expressed their gratitude to you and gave you some gold coins as an advance payment.",
      "You shook your head. The task was too difficult, and you didn’t want to be someone who breaks their promises."
    ],
    "OPTIONS": [
      "[Join Them] #gThe adventure will head towards a different ending.",
      "[Help Deal with the Heart] #gGain #g",
      " #gGold.",
      "[Leave]",
      "[Leave]"
    ]
  },
  "rhinemod:AmongstTheStars": {
    "NAME": "Amongst The Stars",
    "DESCRIPTIONS": [
      "The dome enveloping the ceiling suddenly opens itself. False starlight floods the Tower. NL On the planetarium before you, the stars begin to move erratically. Just like in countless experiments before, no matter how many times you try, they just refuse to stay on the right track. NL From here, open the sky above, and only then can the truth be perceived.",
      "Silver liquid spews out from the planetarium, and in an instant, all the planets are thrown out of their orbits, rushing towards a single position at a speed too fast for the naked eye. The entire galaxy pours down on you. You have weathered the storm. You cross the galaxy. The true sky is within reach.",
      "You'd like to gaze at the stars together, just like you did before. NL ... NL The sky is beautiful.",
      "You still have time to turn back, before you hit the barrier. Sacrifice should not be approved, even justified and inevitable. A real pioneer should be clearing the way for all humanity, instead of jumping headfirst into the abyss, never to return."
    ],
    "OPTIONS": [
      "[Continue] #gObtain #yEgotist, #yTraitor, #ySeeker, #yLoner, #yPioneer.",
      "[Stop] #gHeal #g",
      " #gHP.",
      "[Leave]",
      "[Leave]"
    ]
  },
  "rhinemod:HeartEvent": {
    "NAME": "The Heart",
    "DESCRIPTIONS": [
      "You gathered the residual energy from the three gem key fragments collected earlier in the tower, transforming it into points of light that gradually merged into the LoneTrail Badge.",
      "No matter what, the Heart must still be confronted. NL Its pulsations disrupt all data calculations, and it harbors immense hostility toward you.",
      "Saria clenched her fist...",
      "~One~ ~punch~ ~...~",
      "@Two@ @punches@ @...@",
      "@Three@ @punches!@",
      "The Heart was pierced through, and the greatest threat has been eliminated. Now it’s time to break through the Starpod."
    ],
    "OPTIONS": [
      "[Continue]",
      "[Fight]",
      "[Leave]"
    ]
  },
  "rhinemod:UnsecuredCorridors": {
    "NAME": "Unsecured Corridors",
    "DESCRIPTIONS": [
      "You pushed open a heavy door, only to be greeted by an unexpectedly shabby sight. The walls around you were smooth and flat, resembling an ordinary storage room. The only exception was a partition door on one side, exuding an air of mystery, as if something extremely important was hidden behind it.",
      "A phrase rings in your head:\" ~If~ ~I~ ~had~ ~any~ ~say~ ~in~ ~it,~ ~this~ ~place~ ~would~ ~be~ ~stuffed~ ~full~ ~of~ @power@ @armor@ .\" NL In an instant, several power armors appeared before you, their metallic joints emitting a low, rumbling @hum@ as they charged toward you.",
      "\"There must be quite a few traps here,\" you decided to quickly cross the corridor to avoid them as much as possible. NL You navigated through @the@ @spears@ @emerged@ @from@ @the@ @ground@ , @floor@ @that@ @suddenly@ @collapsed@ , but didn't dodge @the@ @flying@ @blades@ , resulting in injuries as you entered the partition door. Behind the door was only a #gsmall #gball covered with glass, which you put into your pocket.",
      "You felt you should stay focused on the goal of being here and not waste time on such irrelevant matters. You turned around and left."
    ],
    "OPTIONS": [
      "[Recollect] You recalled a classic comment made by a colleague.",
      "[Continue] #rTake #r",
      " #rDamage. #gObtain #gDor-3 #gBionic.",
      "[Leave]",
      "[Fight] #rEngage #rin #ra #rdifficult #rbattle. #gObtain #g2 #gRelics."
    ]
  },
  "rhinemod:TheCure": {
    "NAME": "The Cure",
    "DESCRIPTIONS": [
      "The stairs of the tower suddenly change, the passageway for the other end @instantly@ @open@ . The light coming in mapped out a brown Liberi, you recognize she is Olivia Silence from Structural Section NL \"You want to tear a corner of the sky, but even if we all raise our heads, it doesn't means the problems under our feet will simply disappear. Knowing this, do you still want to move forward regardless?\"",
      "\"Yes, at all cost.\" NL Silence gives her own unmanned aerial vehicle to you, it will help you bridge the gap between your dreams.",
      "\"Yes, unless there are insurmountable obstacles.\" NL Silence pulls out a bottle of potion that glitters with gold and wishes you all a safe trip home.",
      "\"...\" you hesitated. NL Silence looks to one of you, \"I know how far a scientist would go for her dream. I know that feeling of rapture, which is why I know the strength it takes to fight it with morality.\" NL \"Saria, you've long been seeking a balance between science and order. You do well; perhaps too well.\" NL \"Your order is falling apart. But if you're willing to let balance go... perhaps you'll find your roots amidst the chaos.\" NL \"I believe you can.\"",
      "The stairs of the tower suddenly change, the passageway for the other end @instantly@ @open@ . The light coming in mapped out a brown Liberi. \"Hello, we meet again. Is there anything you need help with this time?\"",
      "\"Be careful, don't break it.\" After collecting the material fee, she handed the drone by her side to you.",
      "\"I hope this can give you courage.\" She pulls out a bottle of potion that glitters with gold and wishes you a safe trip home."
    ],
    "OPTIONS": [
      "[Determination] #rLose #y75 #rGold， #gObtain #gAuxiliary #gDrone.",
      "[Vigil] #gObtain #gFairy #gin #ga #gBottle.",
      "[Hesitation] #gObtain #gTracing #gOrigins.",
      "[Leave]",
      "[Locked] Requires: At least 75 Gold."
    ]
  },
  "rhinemod:StarlitNight": {
    "NAME": "Starlit Night",
    "DESCRIPTIONS": [
      "You walked into a thick fog, and in a daze, you found yourself back on that night from your college days. The voice of Muelsyse, sounding a degree younger, echoed in your ears: 'Look at that stone, what does it resemble?' ... Right, what did that stone look like?",
      "Kristen grabs the shining stone, and looks up. She seems to be comparing it to something, as she moves the rock around... NL \"Scientists do not believe that dreams are false. Because what they're essentially doing is proving to all humanity that dreams can come true.\" She said at the end.",
      "\"Oh, come on! It looks like Saria, right? It's so hard, and yet it shines so 'perfectly!'\" Muelsyse took a big bite of the cream puff, as if to say that no one understood her joke.",
      "Losing judgment due to emotions is foolish, especially since this is an illusion of the past. Since it's an illusion, all you need to do is break through it."
    ],
    "OPTIONS": [
      "[Like Star] #gObtain #g\"Imperishable\".",
      "[Like Saria] #gObtain #gWaterdrop #gManifestation.",
      "[Stone is Just Stone] #gObatin #gCalcareous #gStamp.",
      "[Leave]"
    ]
  }
}